docs/org/btranslator-api-reference.org
#+TITLE:     B-Translator API Reference
#+AUTHOR:    Dashamir Hoxha
#+EMAIL:     dashohoxha@gmail.com
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:overview toc:t ltoc:t mouse:#aadddd buttons:0 path:org-info.js
#+STYLE: <link rel="stylesheet" type="text/css" href="org-info.css" />

* report

** statistics

   General statistics (number of votes and translations) for the last
   week, month and year.

   + GET public/btr/report/statistics ::
     - lng :: language of translations

   + POST public/btr/report/statistics ::
     - lng: :: language of translations

   Example: [[https://dev.btranslator.org/api-examples/php/report/statistics.php]]

** topcontrib

   Statistics about top contributors.

   + GET public/btr/report/topcontrib ::
     - lng :: language of translations
     - period :: period of report (last =day | week | month | year=)
     - size :: number of results (top contributers), between 5 and 20

   + POST public/btr/report/topcontrib ::
     - lng :: language of translations
     - period :: period of report (last =day | week | month | year=)
     - size :: number of results (top contributers), between 5 and 20

   Example: [[https://dev.btranslator.org/api-examples/php/report/topcontrib.php]]

* translations

** get_random_sguid

   Get the sguid of a random string according to the target.

   + POST public/btr/translations/get_random_sguid ::
     - target :: Can be one of: =next | translated | untranslated=
     - lng :: Code of the language (required for translated and untranslated)
     - last_sguid :: (optional) Restricts the pool of selection to the
                     project(s) of the last reviewed sguid.
     - scope :: (optional) Restricts the pool of selection to the
         given list of project. It is a space separated list of
         origin/project like this: =origin1/project1 origin2
         origin1/project2=

   Example: [[https://dev.btranslator.org/api-examples/php/translations/sguid.php]]


** get

   Get a string, along with its translations, votes and other details.

   + GET public/btr/translations/$sguid ::
     - sguid :: The string (globally unique) id, calculated as:
                =$sguid = sha1($string . $context)= It can also be:
                =next | translated | untranslated=.
     - lng :: The language of translations, like fr, de, etc.

   + POST public/btr/translations/get ::
     - sguid :: The string (globally unique) id, calculated as:
                =$sguid = sha1($string . $context)= It can also be:
                =next | translated | untranslated=.
     - lng :: The language of translations, like fr, de, etc.

     Example: [[https://dev.btranslator.org/api-examples/php/translations/get.php]]

   + GET translations/$lng/$sguid :: Returns the details of a string
     and its translations.  If the request header =Accept:
     application/json= is set, then the output will be in JSON
     (otherwise it will be an HTML page). The parameter /$sguid/ can
     also be one of =next | translated | untranslated=.

     Example:
     #+BEGIN_EXAMPLE
     curl -k -H 'Accept: application/json' \
       'https://dev.btranslator.org/translations/sq/ee178b82f7ff3b5fb48537b834db673b42d48556'
     curl -k -H 'Accept: application/json' https://dev.btranslator.org/translations/sq/next
     #+END_EXAMPLE


** add

   Add a new translation to a source string.

   + POST btr/translations/add ::
     - sguid ::
         The string ID for which a new translation should be added.
     - lng ::
         The language (code) of the new translation.
     - translation ::
         The new translation as a string. If the string has plural
         version(s) as well, they are concatenated with NULL bytes ("\0")
         between them.

     Example: [[https://dev.btranslator.org/api-examples/php/translations/add.php]]


** vote

   Add a vote for the given translation.

   + POST btr/translations/vote ::
     - tguid :: ID of the translation

   Example: [[https://dev.btranslator.org/api-examples/php/translations/vote.php]]


** del

   Delete a translation

   + POST btr/translations/del ::
     - tguid :: ID of the translation

   Example: [[https://dev.btranslator.org/api-examples/php/translations/add.php]]


** del_vote

   Delete a vote from the given translation.

   + POST btr/translations/del_vote ::
     - tguid :: ID of the translation

   Example: [[https://dev.btranslator.org/api-examples/php/translations/vote.php]]


