docs/html/btranslator-api-reference.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>B-Translator API Reference</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-04 17:44:35 CEST"/>
<meta name="author" content="Dashamir Hoxha"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org-info.css" />
</head>
<body>
<div id="content">

<h1 class="title">B-Translator API Reference</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">report </a>
<ul>
<li><a href="#sec-1.1">statistics </a></li>
<li><a href="#sec-1.2">topcontrib </a></li>
</ul>
</li>
<li><a href="#sec-2">translations </a>
<ul>
<li><a href="#sec-2.1">get_random_sguid </a></li>
<li><a href="#sec-2.2">get </a></li>
<li><a href="#sec-2.3">add </a></li>
<li><a href="#sec-2.4">vote </a></li>
<li><a href="#sec-2.5">del </a></li>
<li><a href="#sec-2.6">del_vote </a></li>
<li><a href="#sec-2.7">search </a></li>
<li><a href="#sec-2.8">submit </a></li>
<li><a href="#sec-2.9">import </a></li>
</ul>
</li>
<li><a href="#sec-3">project </a>
<ul>
<li><a href="#sec-3.1">list </a></li>
<li><a href="#sec-3.2">export </a></li>
<li><a href="#sec-3.3">diff </a></li>
<li><a href="#sec-3.4">add_string </a></li>
<li><a href="#sec-3.5">del_string </a></li>
<li><a href="#sec-3.6">import </a></li>
</ul>
</li>
<li><a href="#sec-4">misc </a>
<ul>
<li><a href="#sec-4.1">latest </a></li>
<li><a href="#sec-4.2">rss-feed </a></li>
<li><a href="#sec-4.3">twitter </a></li>
<li><a href="#sec-4.4">vocabulary </a></li>
<li><a href="#sec-4.5">autocomplete </a></li>
<li><a href="#sec-4.6">other </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">report </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">statistics </h3>
<div class="outline-text-3" id="text-1.1">


<p>
General statistics (number of votes and translations) for the last
week, month and year.
</p>
<dl>
<dt>GET public/btr/report/statistics</dt><dd>

<dl>
<dt>lng</dt><dd>
language of translations

</dd>
</dl>
</dd>
<dt>POST public/btr/report/statistics</dt><dd>

<dl>
<dt>lng:</dt><dd>
language of translations

</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/report/statistics.php">https://dev.btranslator.org/api-examples/php/report/statistics.php</a>
</p>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">topcontrib </h3>
<div class="outline-text-3" id="text-1.2">


<p>
Statistics about top contributors.
</p>
<dl>
<dt>GET public/btr/report/topcontrib</dt><dd>

<dl>
<dt>lng</dt><dd>
language of translations
</dd>
<dt>period</dt><dd>
period of report (last <code>day | week | month | year</code>)
</dd>
<dt>size</dt><dd>
number of results (top contributers), between 5 and 20

</dd>
</dl>
</dd>
<dt>POST public/btr/report/topcontrib</dt><dd>

<dl>
<dt>lng</dt><dd>
language of translations
</dd>
<dt>period</dt><dd>
period of report (last <code>day | week | month | year</code>)
</dd>
<dt>size</dt><dd>
number of results (top contributers), between 5 and 20

</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/report/topcontrib.php">https://dev.btranslator.org/api-examples/php/report/topcontrib.php</a>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">translations </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">get_random_sguid </h3>
<div class="outline-text-3" id="text-2.1">


<p>
Get the sguid of a random string according to the target.
</p>
<dl>
<dt>POST public/btr/translations/get_random_sguid</dt><dd>

<dl>
<dt>target</dt><dd>
Can be one of: <code>next | translated | untranslated</code>
</dd>
<dt>lng</dt><dd>
Code of the language (required for translated and untranslated)
</dd>
<dt>last_sguid</dt><dd>
(optional) Restricts the pool of selection to the
project(s) of the last reviewed sguid.
</dd>
<dt>scope</dt><dd>
(optional) Restricts the pool of selection to the
given list of project. It is a space separated list of
origin/project like this: <code>origin1/project1 origin2          origin1/project2</code>

</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/sguid.php">https://dev.btranslator.org/api-examples/php/translations/sguid.php</a>
</p>

</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">get </h3>
<div class="outline-text-3" id="text-2.2">


<p>
Get a string, along with its translations, votes and other details.
</p>
<dl>
<dt>GET public/btr/translations/$sguid</dt><dd>

<dl>
<dt>sguid</dt><dd>
The string (globally unique) id, calculated as:
<code>$sguid = sha1($string . $context)</code> It can also be:
<code>next | translated | untranslated</code>.
</dd>
<dt>lng</dt><dd>
The language of translations, like fr, de, etc.

</dd>
</dl>
</dd>
<dt>POST public/btr/translations/get</dt><dd>

<dl>
<dt>sguid</dt><dd>
The string (globally unique) id, calculated as:
<code>$sguid = sha1($string . $context)</code> It can also be:
<code>next | translated | untranslated</code>.
</dd>
<dt>lng</dt><dd>
The language of translations, like fr, de, etc.

</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/get.php">https://dev.btranslator.org/api-examples/php/translations/get.php</a>
</p>
</dd>
<dt>GET translations/$lng/$sguid</dt><dd>
Returns the details of a string
and its translations.  If the request header <code>Accept:      application/json</code> is set, then the output will be in JSON
(otherwise it will be an HTML page). The parameter <i>$sguid</i> can
also be one of <code>next | translated | untranslated</code>.

<p>
Example:
</p>


<pre class="example">curl -k -H 'Accept: application/json' \
  'https://dev.btranslator.org/translations/sq/ee178b82f7ff3b5fb48537b834db673b42d48556'
curl -k -H 'Accept: application/json' https://dev.btranslator.org/translations/sq/next
</pre>





</dd>
</dl>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3">add </h3>
<div class="outline-text-3" id="text-2.3">


<p>
Add a new translation to a source string.
</p>
<dl>
<dt>POST btr/translations/add</dt><dd>

<dl>
<dt>sguid</dt><dd>

<p>
The string ID for which a new translation should be added.
</p></dd>
<dt>lng</dt><dd>

<p>
The language (code) of the new translation.
</p></dd>
<dt>translation</dt><dd>

<p>
The new translation as a string. If the string has plural
version(s) as well, they are concatenated with NULL bytes ("\0")
between them.
</p>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/add.php">https://dev.btranslator.org/api-examples/php/translations/add.php</a>
</p>

</dd>
</dl>
</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4">vote </h3>
<div class="outline-text-3" id="text-2.4">


<p>
Add a vote for the given translation.
</p>
<dl>
<dt>POST btr/translations/vote</dt><dd>

<dl>
<dt>tguid</dt><dd>
ID of the translation

</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/vote.php">https://dev.btranslator.org/api-examples/php/translations/vote.php</a>
</p>

</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5">del </h3>
<div class="outline-text-3" id="text-2.5">


<p>
Delete a translation
</p>
<dl>
<dt>POST btr/translations/del</dt><dd>

<dl>
<dt>tguid</dt><dd>
ID of the translation

</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/add.php">https://dev.btranslator.org/api-examples/php/translations/add.php</a>
</p>

</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6">del_vote </h3>
<div class="outline-text-3" id="text-2.6">


<p>
Delete a vote from the given translation.
</p>
<dl>
<dt>POST btr/translations/del_vote</dt><dd>

<dl>
<dt>tguid</dt><dd>
ID of the translation

</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/vote.php">https://dev.btranslator.org/api-examples/php/translations/vote.php</a>
</p>

</div>

</div>
