docs/org/btranslator-api-reference.org
** search

   Search strings and translations using various filters.

   + GET public/btr/translations :: This provides the same
     functionality and has the same parameters as the *search*
     operation.  The only difference is that the parameters are
     provided as a GET request (in the URL), whereas the parameters of
     'search' are provided as a POST request. Sometimes this may be
     more convenient.

   + POST public/btr/translations/search ::
     - lng ::
         The language of translations.
     - limit ::
         The number of results to be returned (min: 5, max: 50).
     - words ::
         Words to be searched for.
     - sguid ::
         If the /words/ is empty and there is a /sguid/ then the
         words of this string are used for searching.
     - mode ::
         Search mode. Can be one of:
         - natural-strings :       Natural search on strings (default).
         - natural-translations :  Natural search on translations.
         - boolean-strings :       Boolean search on strings.
         - boolean-translations :  Boolean search on translations.
     - page ::
         Page of results to be displayed.
     - project ::
         Limit search only to this project
     - origin ::
         Limit search only to the projects of this origin.
     - only_mine :: (boolean)
         Limit search only to the strings touched (translated or voted)
         by the current user.
     - translated_by ::
         Limit search by the author of translations
         (can be used only by admins).
     - voted_by ::
         Limit search by a voter (can be used only by admins).
     - date_filter ::
         Which date to filter (used only by admins). Can be one of:
         - strings :       Filter Strings By Date
         - translations :  Filter Translations By Date (default)
         - votes :         Filter Votes By Date
     - from_date ::
         Date and time.
     - to_date ::
         Date and time.

     Example: [[https://dev.btranslator.org/api-examples/php/translations/search.php]]

  + GET translations/search :: Search strings and translations using
    various filters.  If the request header =Accept: application/json=
    is set, then the output will be in JSON (otherwise it will be an
    HTML page). It gets the same parameters as =GET
    public/btr/translations=

    Example:
    #+BEGIN_EXAMPLE
    curl -k -H 'Accept: application/json' \
         'https://dev.btranslator.org/translations/search?lng=sq&words=space'
    curl -k -H 'Accept: application/json' \
         'https://l10n.org.al/translations/search?lng=sq&words=space'
    #+END_EXAMPLE


** submit

   Submit multiple actions at once.

   + POST btr/translations/submit ::
         Array of actions. Each action is an associated array
         that contains the items:
         - action ::
             The action to be done: =add | vote | del | del_vote=
         - params ::
             Associative array of the needed parameters for this action.

   Example: [[https://dev.btranslator.org/api-examples/php/translations/submit.php]]


** import

   Import translations from PO files.

   + POST btr/translations/import ::
     - lng ::
         Language of translations.
     - file ::
         A PO file with translations, or an archive of PO files
         (accepted extensions: .tar, .gz, .tgz, .bz2, .xz, .7z, .zip).

     Returns associative array containing:
     - messages ::
         Array of notification messages; each notification message
         is an array of a message and a type, where type can be one of
         'status', 'warning', 'error'.

   Example: [[https://dev.btranslator.org/api-examples/php/translations/import.php]]

   This is like a bulk translation and voting service. For any
   translation in the PO files, it will be added as a suggestion if
   such a translation does not exist, or it will just be voted if such
   a translation already exists. In case that the translation already
   exists but its author is not known, then you (the user who makes
   the import) will be recorded as the author of the translation.

   This can be useful for translators if they prefer to work off-line
   with PO files. They can export the PO files of a project, work on
   them with desktop tools (like Lokalize) to translate or correct
   exported translations, and then import back to B-Translator the
   translated/corrected PO files.


* project

** list

   Get a list of existing projects, filtered by origin/project.

   + POST public/btr/project/list ::
     - origin :: Filter by origin.
     - project :: Filter by project.

     Parameters *origin* and *project* can contain =*=, which is
     replaced by =%= (for LIKE matches).

     If *project* is =-= then only a list of 'origin' is outputed,
     otherwise a list of 'origin/project'.

     Example: [[https://dev.btranslator.org/api-examples/php/project/list.php]]

     Examples:
     #+BEGIN_EXAMPLE
     curl -k -X POST https://dev.btranslator.org/public/btr/project/list
     curl -k -X POST https://dev.btranslator.org/public/btr/project/list \
          -H "Content-type: application/json" \
          -d '{"origin": "t*"}'
     #+END_EXAMPLE

   + GET translations/project/list/$origin/$project[/$format] ::
     Return a plain-text list of all the imported projects, filtered
     by the given origin/project. Parameters *origin* and *project*
     can contain =*=, which is replaced by =%= (for LIKE matches).  If
     *project* is =-= then only a list of 'origin' is outputed,
     otherwise a list of 'origin/project'.  The third variable can be
     JSON or TEXT (default).

     Example:
     #+BEGIN_EXAMPLE
     curl 'https://btranslator.org/translations/project/list/*/-'
     curl 'https://btranslator.org/translations/project/list/*/-/json'
     curl 'https://btranslator.org/translations/project/list/LibreOffice/s*'
     curl 'https://btranslator.org/translations/project/list/LibreOffice'
     curl 'https://btranslator.org/translations/project/list/*/nautil*'
     curl 'https://btranslator.org/translations/project/list/*/*/json'
     curl 'https://btranslator.org/translations/project/list'
     #+END_EXAMPLE


