docs/html/btranslator-api-reference.html

<div id="outline-container-2.7" class="outline-3">
<h3 id="sec-2.7">search </h3>
<div class="outline-text-3" id="text-2.7">


<p>
Search strings and translations using various filters.
</p>
<dl>
<dt>GET public/btr/translations</dt><dd>
This provides the same
functionality and has the same parameters as the <b>search</b>
operation.  The only difference is that the parameters are
provided as a GET request (in the URL), whereas the parameters of
'search' are provided as a POST request. Sometimes this may be
more convenient.

</dd>
<dt>POST public/btr/translations/search</dt><dd>

<dl>
<dt>lng</dt><dd>

<p>
The language of translations.
</p></dd>
<dt>limit</dt><dd>

<p>
The number of results to be returned (min: 5, max: 50).
</p></dd>
<dt>words</dt><dd>

<p>
Words to be searched for.
</p></dd>
<dt>sguid</dt><dd>

<p>
If the <i>words</i> is empty and there is a <i>sguid</i> then the
words of this string are used for searching.
</p></dd>
<dt>mode</dt><dd>

<p>
Search mode. Can be one of:
</p><ul>
<li>
natural-strings :       Natural search on strings (default).
</li>
<li>
natural-translations :  Natural search on translations.
</li>
<li>
boolean-strings :       Boolean search on strings.
</li>
<li>
boolean-translations :  Boolean search on translations.
</li>
</ul>
</dd>
<dt>page</dt><dd>

<p>
Page of results to be displayed.
</p></dd>
<dt>project</dt><dd>

<p>
Limit search only to this project
</p></dd>
<dt>origin</dt><dd>

<p>
Limit search only to the projects of this origin.
</p></dd>
<dt>only_mine</dt><dd>
(boolean)
Limit search only to the strings touched (translated or voted)
by the current user.
</dd>
<dt>translated_by</dt><dd>

<p>
Limit search by the author of translations
(can be used only by admins).
</p></dd>
<dt>voted_by</dt><dd>

<p>
Limit search by a voter (can be used only by admins).
</p></dd>
<dt>date_filter</dt><dd>

<p>
Which date to filter (used only by admins). Can be one of:
</p><ul>
<li>
strings :       Filter Strings By Date
</li>
<li>
translations :  Filter Translations By Date (default)
</li>
<li>
votes :         Filter Votes By Date
</li>
</ul>
</dd>
<dt>from_date</dt><dd>

<p>
Date and time.
</p></dd>
<dt>to_date</dt><dd>

<p>
Date and time.
</p>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/search.php">https://dev.btranslator.org/api-examples/php/translations/search.php</a>
</p>
</dd>
</dl>
<dl>
<dt>GET translations/search</dt><dd>
Search strings and translations using
various filters.  If the request header <code>Accept: application/json</code>
is set, then the output will be in JSON (otherwise it will be an
HTML page). It gets the same parameters as <code>GET     public/btr/translations</code>

<p>
Example:
</p>


<pre class="example">curl -k -H 'Accept: application/json' \
     'https://dev.btranslator.org/translations/search?lng=sq&amp;words=space'
curl -k -H 'Accept: application/json' \
     'https://l10n.org.al/translations/search?lng=sq&amp;words=space'
</pre>





</dd>
</dl>
</div>

</div>

<div id="outline-container-2.8" class="outline-3">
<h3 id="sec-2.8">submit </h3>
<div class="outline-text-3" id="text-2.8">


<p>
Submit multiple actions at once.
</p>
<dl>
<dt>POST btr/translations/submit</dt><dd>

<p>
Array of actions. Each action is an associated array
that contains the items:
</p><dl>
<dt>action</dt><dd>

<p>
The action to be done: <code>add | vote | del | del_vote</code>
</p></dd>
<dt>params</dt><dd>

<p>
Associative array of the needed parameters for this action.
</p>
</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/submit.php">https://dev.btranslator.org/api-examples/php/translations/submit.php</a>
</p>

</div>

</div>

<div id="outline-container-2.9" class="outline-3">
<h3 id="sec-2.9">import </h3>
<div class="outline-text-3" id="text-2.9">


<p>
Import translations from PO files.
</p>
<dl>
<dt>POST btr/translations/import</dt><dd>

<dl>
<dt>lng</dt><dd>

<p>
Language of translations.
</p></dd>
<dt>file</dt><dd>

<p>
A PO file with translations, or an archive of PO files
(accepted extensions: .tar, .gz, .tgz, .bz2, .xz, .7z, .zip).
</p>
</dd>
</dl>

<p>Returns associative array containing:
</p><dl>
<dt>messages</dt><dd>

<p>
Array of notification messages; each notification message
is an array of a message and a type, where type can be one of
'status', 'warning', 'error'.
</p>
</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/translations/import.php">https://dev.btranslator.org/api-examples/php/translations/import.php</a>
</p>
<p>
This is like a bulk translation and voting service. For any
translation in the PO files, it will be added as a suggestion if
such a translation does not exist, or it will just be voted if such
a translation already exists. In case that the translation already
exists but its author is not known, then you (the user who makes
the import) will be recorded as the author of the translation.
</p>
<p>
This can be useful for translators if they prefer to work off-line
with PO files. They can export the PO files of a project, work on
them with desktop tools (like Lokalize) to translate or correct
exported translations, and then import back to B-Translator the
translated/corrected PO files.
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">project </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">list </h3>
<div class="outline-text-3" id="text-3.1">


<p>
Get a list of existing projects, filtered by origin/project.
</p>
<dl>
<dt>POST public/btr/project/list</dt><dd>

<dl>
<dt>origin</dt><dd>
Filter by origin.
</dd>
<dt>project</dt><dd>
Filter by project.

</dd>
</dl>

<p>Parameters <b>origin</b> and <b>project</b> can contain <code>*</code>, which is
replaced by <code>%</code> (for LIKE matches).
</p>
<p>
If <b>project</b> is <code>-</code> then only a list of 'origin' is outputed,
otherwise a list of 'origin/project'.
</p>
<p>
Example: <a href="https://dev.btranslator.org/api-examples/php/project/list.php">https://dev.btranslator.org/api-examples/php/project/list.php</a>
</p>
<p>
Examples:
</p>


<pre class="example">curl -k -X POST https://dev.btranslator.org/public/btr/project/list
curl -k -X POST https://dev.btranslator.org/public/btr/project/list \
     -H "Content-type: application/json" \
     -d '{"origin": "t*"}'
</pre>




</dd>
<dt>GET translations/project/list/$origin/$project[/$format]</dt><dd>

<p>
Return a plain-text list of all the imported projects, filtered
by the given origin/project. Parameters <b>origin</b> and <b>project</b>
can contain <code>*</code>, which is replaced by <code>%</code> (for LIKE matches).  If
<b>project</b> is <code>-</code> then only a list of 'origin' is outputed,
otherwise a list of 'origin/project'.  The third variable can be
JSON or TEXT (default).
</p>
<p>
Example:
</p>


<pre class="example">curl 'https://btranslator.org/translations/project/list/*/-'
curl 'https://btranslator.org/translations/project/list/*/-/json'
curl 'https://btranslator.org/translations/project/list/LibreOffice/s*'
curl 'https://btranslator.org/translations/project/list/LibreOffice'
curl 'https://btranslator.org/translations/project/list/*/nautil*'
curl 'https://btranslator.org/translations/project/list/*/*/json'
curl 'https://btranslator.org/translations/project/list'
</pre>





</dd>
</dl>
</div>

</div>
