docs/org/btranslator-api-reference.org
** export

   + POST btr/project/export :: Schedule a project for export. When
     the request is completed, the user will be notified by
     email. Accepts these parameters:

     - origin ::
         The origin of the project.
     - project ::
         The name of the project.
     - lng ::
         Translation to be exported.
     - export_mode ::
         The export mode that should be used. It can be one of:
         =original | most_voted | preferred=.
         - The mode =original= exports the translations of the
           original files that were imported.
         - The mode =most_voted= exports the translations with the
           highest number of votes.
         - The mode =preferred= gives precedence to the translations
           voted by a user or a list of users, despite the number of
           votes.
     - preferred_voters ::
         Comma separated list of usernames. Used only when /export_mode/
         is =preferred=.

     Example: [[https://dev.btranslator.org/api-examples/php/project/export.php]]


   + GET/POST translations/project/export :: Return an archive of PO
     files for a given origin/project/lng. Does not allow concurrent
     exports because they may affect the performance of the server.
     Parameters are received from the request (either GET or
     POST). They are:
     - origin ::
         Origin of the project.
     - project ::
         The name of the project.
     - lng ::
         Translation to be exported.
     - export_mode ::
         Mode of export: =most_voted | preferred | original=

         Default is =most_voted= which exports the most voted
         translations and suggestions.

         The export mode =original= exports the translations of the
         original file that was imported (useful for making diffs).

         The export mode =preferred= gives priority to translations
         that are voted by a certain user or a group of users. It
         requires an additional argument (preferred_voters) to specify
         the user (or a list of users) whose translations are
         preferred.
     - preferred_voters ::
         Comma separated list of usernames of the preferred voters.

     Examples:
     #+BEGIN_EXAMPLE
     curl -k 'https://dev.btranslator.org/translations/project/export?origin=test&project=kturtle&lng=sq' > test1.tgz
     curl -k https://dev.btranslator.org/translations/project/export \
          -d 'origin=test&project=kturtle&lng=sq&export_mode=original' > test1.tgz
     curl -k https://dev.btranslator.org/translations/project/export \
          -d origin=test -d project=kturtle -d lng=sq \
          -d export_mode=preferred \
          -d preferred_voters=user1,user2 > test1.tgz
     #+END_EXAMPLE

** diff

   + GET translations/project/diff/$origin/$project/$lng[/$nr[/$ediff]] ::
     Return as plain-text the diff of the PO file for a given
     origin/project/lng, which contains the latest most-voted
     suggestions since the last snapshot. If the parameter *$nr* is
     missing, it returns a list of the saved diffs instead.

     For more details about diffs see: [[https://github.com/B-Translator/btr_server/blob/master/modules/custom/btrCore/data/README.org#snapshots-and-diffs][README.org#snapshots-and-diffs]]

     Examples:
     #+BEGIN_EXAMPLE
     curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq
     curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/2 > 2.diff
     curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/2/ediff > 2.ediff
     curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/4 > 4.diff
     curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/4/ediff > 4.ediff
     #+END_EXAMPLE


** add_string

   Add a new string to a project (useful for vocabularies).

   + POST btr/project/add_string ::
     - origin ::
         Origin (category) of the project.
     - project ::
         Name of the project.
     - tplname :: (optional)
         Name of the template (POT) file.
     - string ::
         String to be added.
     - context :: (optional)
         The context of the string.
     - notify :: (optional)
         It TRUE, notify translators about the new string.

     Returns associative array containing:
     - sguid ::
         The sguid of the new string, or NULL if such a string
         already exists.

   Example: [[https://dev.btranslator.org/api-examples/php/project/add_string.php]]

   Vocabularies are fake translation projects, in the sense that they
   are not strings extracted from a program. Their strings are added
   manually. They serve as a collection/dictionary of interesting,
   important and frequently used terms and their suggested
   translations. They can be useful for translators on their everyday
   job and also can help to discuss and unify the terminology used
   across different programs.


** del_string

   Delete a string from a project (useful for vocabularies).

   + POST btr/project/del_string ::
     - sguid ::
         ID of the string to be deleted.
     - project ::
         The project from which the string will be deleted.
     - origin :: (optional)
         The origin of the project (default: 'vocabulary').

   Example: [[https://dev.btranslator.org/api-examples/php/project/add_string.php]]


** import

   Create a custom project (or update an existing one) by importing
   PO/POT file(s).

   + POST btr/project/import ::
     - origin ::
         The origin of the project that will be imported.
     - project ::
         The name of the project that will be imported.
     - file ::
         A PO file, or an archive of PO/POT files (accepted
         extensions: .tar, .gz, .tgz, .bz2, .xz, .7z, .zip).

     Returns associative array containing:
     - messages ::
         Array of notification messages; each notification message
         is an array of a message and a type, where type can be one of
         'status', 'warning', 'error'.

   Example: [[https://dev.btranslator.org/api-examples/php/project/import.php]]

   This is useful for creating custom translation projects. The PO/POT
   files that are uploaded will be used for importing strings and
   translations. If there are no POT files, then the PO files will be
   used both for importing strings and for importing translations. If
   there are POT files and PO files, their names have to match (except
   for the extension).

   If you want to create a vocabulary, use =vocabulary= as the origin
   of the project, and add the suffix =_lng= to the project name.  Use
   =msgctxt "project_name"= as the context of each string in the PO/POT
   file.  Also the uploaded PO file must have the same name as the
   project, for example =ICT_sq.po=. These restrictions are needed
   because vocabularies are pseudo-projects (for example you can add
   strings to them) and certain assumptions are made about them.


* misc

