docs/html/btranslator-api-reference.html

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">export </h3>
<div class="outline-text-3" id="text-3.2">


<dl>
<dt>POST btr/project/export</dt><dd>
Schedule a project for export. When
the request is completed, the user will be notified by
email. Accepts these parameters:

<dl>
<dt>origin</dt><dd>

<p>
The origin of the project.
</p></dd>
<dt>project</dt><dd>

<p>
The name of the project.
</p></dd>
<dt>lng</dt><dd>

<p>
Translation to be exported.
</p></dd>
<dt>export_mode</dt><dd>

<p>
The export mode that should be used. It can be one of:
<code>original | most_voted | preferred</code>.
</p><ul>
<li>
The mode <code>original</code> exports the translations of the
original files that were imported.
</li>
<li>
The mode <code>most_voted</code> exports the translations with the
highest number of votes.
</li>
<li>
The mode <code>preferred</code> gives precedence to the translations
voted by a user or a list of users, despite the number of
votes.
</li>
</ul>
</dd>
<dt>preferred_voters</dt><dd>

<p>
Comma separated list of usernames. Used only when <i>export_mode</i>
is <code>preferred</code>.
</p>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/project/export.php">https://dev.btranslator.org/api-examples/php/project/export.php</a>
</p>

</dd>
<dt>GET/POST translations/project/export</dt><dd>
Return an archive of PO
files for a given origin/project/lng. Does not allow concurrent
exports because they may affect the performance of the server.
Parameters are received from the request (either GET or
POST). They are:
<dl>
<dt>origin</dt><dd>

<p>
Origin of the project.
</p></dd>
<dt>project</dt><dd>

<p>
The name of the project.
</p></dd>
<dt>lng</dt><dd>

<p>
Translation to be exported.
</p></dd>
<dt>export_mode</dt><dd>

<p>
Mode of export: <code>most_voted | preferred | original</code>
</p>
<p>
Default is <code>most_voted</code> which exports the most voted
translations and suggestions.
</p>
<p>
The export mode <code>original</code> exports the translations of the
original file that was imported (useful for making diffs).
</p>
<p>
The export mode <code>preferred</code> gives priority to translations
that are voted by a certain user or a group of users. It
requires an additional argument (preferred_voters) to specify
the user (or a list of users) whose translations are
preferred.
</p></dd>
<dt>preferred_voters</dt><dd>

<p>
Comma separated list of usernames of the preferred voters.
</p>
</dd>
</dl>

<p>Examples:
</p>


<pre class="example">curl -k 'https://dev.btranslator.org/translations/project/export?origin=test&amp;project=kturtle&amp;lng=sq' &gt; test1.tgz
curl -k https://dev.btranslator.org/translations/project/export \
     -d 'origin=test&amp;project=kturtle&amp;lng=sq&amp;export_mode=original' &gt; test1.tgz
curl -k https://dev.btranslator.org/translations/project/export \
     -d origin=test -d project=kturtle -d lng=sq \
     -d export_mode=preferred \
     -d preferred_voters=user1,user2 &gt; test1.tgz
</pre>




</dd>
</dl>
</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">diff </h3>
<div class="outline-text-3" id="text-3.3">


<dl>
<dt>GET translations/project/diff/$origin/$project/$lng[/$nr[/$ediff]]</dt><dd>

<p>
Return as plain-text the diff of the PO file for a given
origin/project/lng, which contains the latest most-voted
suggestions since the last snapshot. If the parameter <b>$nr</b> is
missing, it returns a list of the saved diffs instead.
</p>
<p>
For more details about diffs see: <a href="https://github.com/B-Translator/btr_server/blob/master/modules/custom/btrCore/data/README.org#snapshots-and-diffs">README.org#snapshots-and-diffs</a>
</p>
<p>
Examples:
</p>


<pre class="example">curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq
curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/2 &gt; 2.diff
curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/2/ediff &gt; 2.ediff
curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/4 &gt; 4.diff
curl https://btranslator.org/translations/project/diff/LibreOffice/sw/sq/4/ediff &gt; 4.ediff
</pre>





</dd>
</dl>
</div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4">add_string </h3>
<div class="outline-text-3" id="text-3.4">


<p>
Add a new string to a project (useful for vocabularies).
</p>
<dl>
<dt>POST btr/project/add_string</dt><dd>

<dl>
<dt>origin</dt><dd>

<p>
Origin (category) of the project.
</p></dd>
<dt>project</dt><dd>

<p>
Name of the project.
</p></dd>
<dt>tplname</dt><dd>
(optional)
Name of the template (POT) file.
</dd>
<dt>string</dt><dd>

<p>
String to be added.
</p></dd>
<dt>context</dt><dd>
(optional)
The context of the string.
</dd>
<dt>notify</dt><dd>
(optional)
It TRUE, notify translators about the new string.

</dd>
</dl>

<p>Returns associative array containing:
</p><dl>
<dt>sguid</dt><dd>

<p>
The sguid of the new string, or NULL if such a string
already exists.
</p>
</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/project/add_string.php">https://dev.btranslator.org/api-examples/php/project/add_string.php</a>
</p>
<p>
Vocabularies are fake translation projects, in the sense that they
are not strings extracted from a program. Their strings are added
manually. They serve as a collection/dictionary of interesting,
important and frequently used terms and their suggested
translations. They can be useful for translators on their everyday
job and also can help to discuss and unify the terminology used
across different programs.
</p>

</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5">del_string </h3>
<div class="outline-text-3" id="text-3.5">


<p>
Delete a string from a project (useful for vocabularies).
</p>
<dl>
<dt>POST btr/project/del_string</dt><dd>

<dl>
<dt>sguid</dt><dd>

<p>
ID of the string to be deleted.
</p>
</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/project/add_string.php">https://dev.btranslator.org/api-examples/php/project/add_string.php</a>
</p>

</div>

</div>

<div id="outline-container-3.6" class="outline-3">
<h3 id="sec-3.6">import </h3>
<div class="outline-text-3" id="text-3.6">


<p>
Create a custom project (or update an existing one) by importing
PO/POT file(s).
</p>
<dl>
<dt>POST btr/project/import</dt><dd>

<dl>
<dt>origin</dt><dd>

<p>
The origin of the project that will be imported.
</p></dd>
<dt>project</dt><dd>

<p>
The name of the project that will be imported.
</p></dd>
<dt>file</dt><dd>

<p>
A PO file, or an archive of PO/POT files (accepted
extensions: .tar, .gz, .tgz, .bz2, .xz, .7z, .zip).
</p>
</dd>
</dl>

<p>Returns associative array containing:
</p><dl>
<dt>messages</dt><dd>

<p>
Array of notification messages; each notification message
is an array of a message and a type, where type can be one of
'status', 'warning', 'error'.
</p>
</dd>
</dl>
</dd>
</dl>

<p>Example: <a href="https://dev.btranslator.org/api-examples/php/project/import.php">https://dev.btranslator.org/api-examples/php/project/import.php</a>
</p>
<p>
This is useful for creating custom translation projects. The PO/POT
files that are uploaded will be used for importing strings and
translations. If there are no POT files, then the PO files will be
used both for importing strings and for importing translations. If
there are POT files and PO files, their names have to match (except
for the extension).
</p>
<p>
If you want to create a vocabulary, use <code>vocabulary</code> as the origin
of the project, and add the suffix <code>_lng</code> to the project name.  Use
=msgctxt "vocabulary"= as the context of each string in the PO/POT
file.  Also the uploaded PO file must have the same name as the
project, for example <code>ICT_sq.po</code>. These restrictions are needed
because vocabularies are pseudo-projects (for example you can add
strings to them) and certain assumptions are made about them.
</p>

</div>
</div>

</div>
